{
"en": {
  "langSel": "Please select your language /seleccione el idioma /Sprache auswählen  /Choisir la langue :  \n 1) English  2) Español  3) Deutsche  4) Français",
  "welcome": "Welcome to Mortgage Calculator!",
  "loanAmt" : "What is the loan amount in dollars?",
  "numError"   : "Hmm, that doesn't look like a number, please try again",
  "zeroError": "Please enter a number greater than zero",
  "APRmsg"  : "What is the percentage APR?(Please enter number only, e.g if the APR is 10.2%, enter 10.2)",
  "zeroAPR" : "Sorry, this app does not support interest-free loans. Please enter a number greater than zero",
  "loanYr"  : "What is the loan duration in years?(Please enter whole year/s only)",
  "loanMnth": "How many, if any, extra months are there in the loan duration in addition to the years just entered?",
  "mnthTotal": "Your monthly instalment to pay is $",
  "AnotherCalc": "Would you like to perform another mortgage payment calculation?"
 },
"es": {
  "welcome": "¡Bienvenido a Calculadora de hipotecas!",
  "loanAmt": "¿Cuál es el monto del préstamo en dólares?",
  "numError"  : " Mmm, eso no parece un número. Vuelve a intentarlo",
  "zeroError": "Ingrese un número mayor que cero",
  "APRmsg" : "¿Cuál es el porcentaje de APR? (Ingrese solo el número, por ejemplo, si el APR es 10.2%, ingrese 10.2)",
  "zeroAPR" : "Lo sentimos, esta aplicación no admite préstamos sin intereses. Ingrese un número mayor que cero",
  "loanYr" : "¿Cuál es la duración del préstamo en años? (Por favor ingrese solo año/s completos)",
  "loanMnth": "¿Cuántos meses adicionales, si es que hay alguno, hay en la duración del préstamo además de los años recién ingresados?",
  "mnthTotal": "Su cuota mensual a pagar es $", 
  "AnotherCalc" : "¿Le gustaría realizar otro cálculo de pag o?"
 },
"de": {
  "welcome":"Willkommen beim Hypothekenrechner!", 
  "loanAmt":"Wie hoch ist der Kreditbetrag in Dollar?",
  "numError": " Hmm, das sieht nicht nach einer Zahl aus, bitte versuchen Sie es erneut",
  "zeroError": "Bitte geben Sie eine Zahl größer als Null ein",
  "APRmsg": "Wie hoch ist der prozentuale Jahreszins? (Bitte geben Sie nur die Zahl ein, z. B. wenn der Jahreszins 10,2% beträgt, geben Sie 10,2 ein.)",
  "zeroAPR": "Entschuldigung, diese App unterstützt keine zinslosen Kredite. Bitte geben Sie eine Zahl größer als Null ein",
  "loanYr": "Wie lange dauert das Darlehen in Jahren? (Bitte nur ganze Jahr (e) eingeben.)",
  "loanMnth":"Wie viele, wenn überhaupt, zusätzliche Monate in der Darlehenslaufzeit gibt es zusätzlich zu den gerade eingegebenen Jahren?",
  "mnthTotal": " Ihre monatliche Rate beträgt $",
  "AnotherCalc": "Möchten Sie eine weitere Zahlungsberechnung durchführen?" 
 },
"fr": {
 "welcome": "Bienvenue dans la calculatrice hypothécaire!",
 "loanAmt": "Quel est le montant du prêt en dollars?",
 "numError": "Hmm, cela ne ressemble pas à un nombre, veuillez réessayer",
 "zeroError": "Veuillez saisir un nombre supérieur à zéro",
 "APRmsg": "Quel est le pourcentage APR? (Veuillez saisir uniquement un nombre, par exemple si le APR est de 10,2%, entrez 10,2)",
 "zeroAPR": "Désolé, cette application ne prend pas en charge les prêts sans intérêt. Veuillez saisir un nombre supérieur à zéro",
 "loanYr": "Quelle est la durée du prêt en années? (Veuillez saisir une ou plusieurs années uniquement)",
 "loanMnth": "Combien de mois supplémentaires, le cas échéant, y a-t-il dans la durée du prêt en plus des années qui viennent d'être saisies?",
 "mnthTotal": "Votre mensualité à payer est de $",
 "AnotherCalc": "Souhaitez-vous effectuer un autre calcul de paiement hypothécaire?" 
 }

}  
